package lesson4.hm.nizamov;

public class Main3 {
    public static void main(String[] args) {
        // Создаем массив 6x6 и сразу заполняем его числами
        int[][] array = {
                {1, 2, 3, 4, 5, 6},
                {7, 8, 9, 10, 11, 12},
                {13, 14, 15, 16, 17, 18},
                {19, 20, 21, 22, 23, 24},
                {25, 26, 27, 28, 29, 30},
                {31, 32, 33, 34, 35, 36}
        };
        /////ЗАДАЧА ТРЕТЬЯ
        System.out.println("3)Вывести в шахматном порядке");
        // Проходим по всем строкам массива
        int i;
        for (i = 0; i < array.length; i++) {
            // Проходим по всем столбцам
            for (int j = 0; j < array[i].length; j++) {
                // Если сумма индексов четная, выводим число
                if ((i + j) % 2 == 0) {
                    System.out.print(array[i][j] + " "); // Выводим число
                } else {
                    System.out.print("  "); // Печатаем пробел для создания шахматного порядка
                }
            }
            System.out.println(); // Переход на новую строку после каждой строки массива
        }
    }
}

